In [1]:
# importing necessary libraries
import pandas as pd

In [2]:
# assigning each dataset to a variable
uber_apr_2014 = pd.read_csv("datasets/uber-raw-data-apr14.csv")
uber_may_2014 = pd.read_csv("datasets/uber-raw-data-may14.csv")
uber_jun_2014 = pd.read_csv("datasets/uber-raw-data-jun14.csv")
uber_jul_2014 = pd.read_csv("datasets/uber-raw-data-jul14.csv")
uber_aug_2014 = pd.read_csv("datasets/uber-raw-data-aug14.csv")
uber_sep_2014 = pd.read_csv("datasets/uber-raw-data-sep14.csv")

In [3]:
# combining uber_apr_to_sep_2014 datasets
uber_apr_to_sep_2014_dataset = pd.concat([uber_apr_2014, uber_may_2014, uber_jun_2014, uber_jul_2014, uber_aug_2014, uber_sep_2014], ignore_index = True)

In [4]:
# loading the dataframe
uber_apr_to_sep_2014_dataset

                  Date/Time      Lat      Lon    Base
0          4/1/2014 0:11:00  40.7690 -73.9549  B02512
1          4/1/2014 0:17:00  40.7267 -74.0345  B02512
2          4/1/2014 0:21:00  40.7316 -73.9873  B02512
3          4/1/2014 0:28:00  40.7588 -73.9776  B02512
4          4/1/2014 0:33:00  40.7594 -73.9722  B02512
...                     ...      ...      ...     ...
4534322  9/30/2014 22:57:00  40.7668 -73.9845  B02764
4534323  9/30/2014 22:57:00  40.6911 -74.1773  B02764
4534324  9/30/2014 22:58:00  40.8519 -73.9319  B02764
4534325  9/30/2014 22:58:00  40.7081 -74.0066  B02764
4534326  9/30/2014 22:58:00  40.7140 -73.9496  B02764

[4534327 rows x 4 columns]

In [5]:
# converting the "Date/Time" column to datetime format
uber_apr_to_sep_2014_dataset['Date/Time'] = pd.to_datetime(uber_apr_to_sep_2014_dataset['Date/Time'])

In [6]:
# loading the dataframe
uber_apr_to_sep_2014_dataset

                  Date/Time      Lat      Lon    Base
0       2014-04-01 00:11:00  40.7690 -73.9549  B02512
1       2014-04-01 00:17:00  40.7267 -74.0345  B02512
2       2014-04-01 00:21:00  40.7316 -73.9873  B02512
3       2014-04-01 00:28:00  40.7588 -73.9776  B02512
4       2014-04-01 00:33:00  40.7594 -73.9722  B02512
...                     ...      ...      ...     ...
4534322 2014-09-30 22:57:00  40.7668 -73.9845  B02764
4534323 2014-09-30 22:57:00  40.6911 -74.1773  B02764
4534324 2014-09-30 22:58:00  40.8519 -73.9319  B02764
4534325 2014-09-30 22:58:00  40.7081 -74.0066  B02764
4534326 2014-09-30 22:58:00  40.7140 -73.9496  B02764

[4534327 rows x 4 columns]